In [ ]:
#DROPING FROM AXIS
# FIND; INDEXING, SELECTION AND FILTERING

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [42]:
# Series is a one-dimentional array object with associated array called Index
# Dictionaties can be easily turned into Series with the (key being index) and (values being values)

In [14]:
obj=Series([4.5, 7.2, -5.3, 3.6])

In [15]:
obj

0    4.5
1    7.2
2   -5.3
3    3.6
dtype: float64

In [16]:
obj.values # show only values

array([ 4.5,  7.2, -5.3,  3.6])

In [17]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
obj[3] #find a member by index

3.6000000000000001

In [46]:
obj[obj>4] #searching for biger, smaller values

0    4.5
1    7.2
dtype: float64

REINDEXING

In [2]:
obj=Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c']) 
#assigning index

In [3]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [23]:
obj.index #searching for index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [24]:
obj2=obj.reindex(['a', 'b', 'c', 'd', 'e']) # e is extra and gets NaN

In [51]:
obj2 # orders the values by the alphabetic order

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [52]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0) #NaN becomes 0

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [28]:
'b' in obj2

True

In [5]:
obj3=Series(['blue', 'purple', 'yellow'], index=[0,2,4])

In [6]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [9]:
obj3.reindex(range(7))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
6       NaN
dtype: object

In [16]:
obj3.reindex(range(7), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
6    yellow
dtype: object

In [11]:
obj3.reindex(range(7), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
6       NaN
dtype: object

In [31]:
#dictionary data into series:

ddata={'ohio':35000, 'texas':71000, 'oregon':16000, 'utah':5000}; 
ddata

{'ohio': 35000, 'oregon': 16000, 'texas': 71000, 'utah': 5000}

In [32]:
obj4=Series(ddata);
obj4

ohio      35000
oregon    16000
texas     71000
utah       5000
dtype: int64

In [58]:
pd.isnull(obj4) # any missing data?

ohio      False
oregon    False
texas     False
utah      False
dtype: bool

In [59]:
pd.notnull(obj4)

ohio      True
oregon    True
texas     True
utah      True
dtype: bool

In [33]:
obj4

ohio      35000
oregon    16000
texas     71000
utah       5000
dtype: int64

In [34]:
states=['california', 'ohio', 'oregon', 'texas']

In [35]:
obj5=Series(ddata, index=states);  
 
obj5

#california has no match so is NaN and Utah is not even present

california        NaN
ohio          35000.0
oregon        16000.0
texas         71000.0
dtype: float64

In [36]:
obj4+obj5 # summed up are only the INNER JOIN items

california         NaN
ohio           70000.0
oregon         32000.0
texas         142000.0
utah               NaN
dtype: float64

In [37]:
obj4.name='population' # giving name to the series (a column title)

In [38]:
obj4.index.name='state'
# giving name to the index of the series (a column title)

In [39]:
obj4

state
ohio      35000
oregon    16000
texas     71000
utah       5000
Name: population, dtype: int64

In [64]:
frame=DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'], 
                columns=['ohio', 'texas', 'california'])

In [65]:
frame

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

In [66]:
frame2=frame.reindex(['a', 'b', 'c', 'd'])
# reindex DF, add a row

In [67]:
frame2

   ohio  texas  california
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [68]:
states=['texas', 'utah', 'california']

In [69]:
frame.reindex(columns=states) # ohio is out and utah NaN 
# keep some columns and prepare another column to be populated

   texas  utah  california
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

# DROPPING ENTRIES FROM AN AXIS

In [3]:
obj=Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [4]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [5]:
new_obj = obj.drop('c') #use existing series without some cases

In [6]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [75]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [3]:
data=DataFrame(np.arange(16). reshape((4, 4)), 
               index=['ohio', 'colorado', 'utah', 'NY'],
                      columns=['one', 'two', 'three', 'four'])

In [6]:
data.index

Index([u'ohio', u'colorado', u'utah', u'NY'], dtype='object')

In [7]:
data.columns

Index([u'one', u'two', u'three', u'four'], dtype='object')

In [9]:
data['one'] # show column by name of column

ohio         0
colorado     4
utah         8
NY          12
Name: one, dtype: int32

In [77]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
NY         12   13     14    15

In [78]:
data.drop(['colorado', 'ohio']) # drop some rows

      one  two  three  four
utah    8    9     10    11
NY     12   13     14    15

In [79]:
data.drop(['two', 'four'], axis=1) # drop some columns

          one  three
ohio        0      2
colorado    4      6
utah        8     10
NY         12     14

In [80]:
# FIND; INDEXING, SELECTION AND FILTERING

In [81]:
obj=Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [82]:
obj[1]

1.0

In [83]:
obj['b']

1.0

In [84]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [85]:
obj[['b', 'a']] 

# Use [[ ]] when asking for more then one element in the object

b    1.0
a    0.0
dtype: float64

In [86]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [87]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [88]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [89]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [90]:
obj['b':'d']=5

In [91]:
obj

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [11]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
NY         12   13     14    15

In [93]:
data['two'] # SHOW A SINGLE COL

ohio         1
colorado     5
utah         9
NY          13
Name: two, dtype: int32

In [94]:
data [['three', 'one']] # SHOW FEW COL

          three  one
ohio          2    0
colorado      6    4
utah         10    8
NY           14   12

In [95]:
data[:2] # SHOW SOME ROWS

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [10]:
# SHOW COLS WHERE THE VAL OF THE COL 'THREE' IS >5 
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
NY         12   13     14    15

In [97]:
data<5

            one    two  three   four
ohio       True   True   True   True
colorado   True  False  False  False
utah      False  False  False  False
NY        False  False  False  False

In [98]:
data[data<5]=0

In [99]:
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
NY         12   13     14    15

In [11]:
data.ix['utah'] # SHOW SPECIFIC ROW

one       8
two       9
three    10
four     11
Name: utah, dtype: int32

In [100]:
data.ix['colorado', ['two', 'three']] 
# SHOW VALUES FOR SPECIF ROW IN SPECIF COLS

two      5
three    6
Name: colorado, dtype: int32

In [101]:
data.ix[['colorado', 'utah'], [3, 0, 1]] 
# SHOW SPECIF VALS FOR SPECIF COLS IN PARTIC ORDER

          four  one  two
colorado     7    0    5
utah        11    8    9

In [12]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
NY         12   13     14    15

In [102]:
data.ix[2]#gives utah

one       8
two       9
three    10
four     11
Name: utah, dtype: int32

In [13]:
data.ix[:'utah', 'two']
#until and including Utah and in the col named 'two'

ohio        1
colorado    5
utah        9
Name: two, dtype: int32

In [104]:
data.ix[data.three>5]

          one  two  three  four
colorado    0    5      6     7
utah        8    9     10    11
NY         12   13     14    15

In [105]:
data.ix[data.three>5, :3]

          one  two  three
colorado    0    5      6
utah        8    9     10
NY         12   13     14

In [4]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
NY         12   13     14    15

In [5]:
data.where(data['two'] > 9)

           one   two  three  four
ohio       NaN   NaN    NaN   NaN
colorado   NaN   NaN    NaN   NaN
utah       NaN   NaN    NaN   NaN
NY        12.0  13.0   14.0  15.0

In [7]:
# more efficient:

data[data['two'] > 8]

      one  two  three  four
utah    8    9     10    11
NY     12   13     14    15

In [9]:
# quering two cols simultaneously:

data[(data['one'] > 6) | (data['four'] > 6)]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
NY         12   13     14    15

In [10]:
data[(data['one'] > 6) & (data['four'] > 6)]

      one  two  three  four
utah    8    9     10    11
NY     12   13     14    15